{
    "general": {
        "Default_Button":
            "Button Selection will appear here when a valid controller is selected."
    },
    "help": {
        "App": 
            "Welcome to the Radiant Dawn Code Wizard.\nThese options will give you a more in depth look at each section and how to use it.\n\nA few things to note:\nThese codes are NOT guaranteed to work.\nI have tried to get it as accurate as I can.\nMissing a character recruitment or having a character die can alter the internal IDs of the characters causing some codes to break.\n\nThe quickest way to get ahold of me for questions or bugs is through my discord server. You can get the link to it from the discord button.\n\nI am always looking for feedback for changes and improvements so any is welcome.\n\nHope you enjoy and find it useful!",
        "Controller": 
            "By default, the controller option is set to None. This means that while the code is turned on, it will be infinitely written to the game.\n\nA good time to use this is for anything like EXP editing for characters, class editing and item editing.\n\nA bad time to use this is when editing character level, class and inventory.\n\nThe only two controllers usable for these codes are a GameCube controller or the classic controller extension for the Wii remote. You should be able to find support to set this up online if you need help.",
        "Difficulty": 
            "By default, the wizard will use Medium/Hard difficulty. There are a few differences in character IDs between Easy and Medium/Hard.\nMedium and Hard difficulties appear to have the same IDs.\n\nI only checked up to part 2 on Hard so if you find one that isn't covered please report it on my discord.",
        "Version": 
            "By default, the code will use NTSC 1.01.\n\nYou can generate codes for NSTC 1.00, NSTC 1.01, PAL 1.01 and for the reverse recruitment mod v5.3 by ViciousSal, which is based on the PAL 1.01 version.\n\nBe sure to check your game version before creating codes.",
        "Character": 
            "In this window there are 4 main sections. The only required section is the Top Left character selection but if you make no other changes then it will not be able to create a code.\n\nTop Left:\nThis is the section used to select the character you want to edit. This selection is required when generating a character code.\n\nTop Right:\nThis is the section used to change a character's class. It is also not recommended to use Controller = None when modifying this field.\n\nBottom Left:\nThis section is where you can edit the character's data. For level, EXP and Current HP, these are going to be exactly what you put in. For the remainder, these are going to be stat increases added on to the characters base stats. For example, if you put 14 into HP, and a characters base HP is 20, you should see the character with 34 HP after using this code.\n\nBottom Right:\nThis section is to edit the character's ranks. Changing the rank of a type the character cannot natively use will not give them the ability to use it. Putting a rank to SS may not actually give them SS. These caps are based on the class in game. As they rank up they should increase to their cap if you use SS on them.\n\nItems Button:\nThis is used to open up the window where you can edit the inventory of the character you have selected in the Top Left section. This should be pretty self explanatory.",
        "Class": 
            "In this window there are 4 main sections. The only required section is the Top Left class selection but if you make no other changes then it will not be able to create a code. Please note that editing a class will affect any character/enemy that has that class. With Gecko codes there is no way to distinguish between some classes for playable characters and enemy characters.\n\nTop Left:\nThis section is used to select the class you want to edit.\n\nTop Right:\nThis section is used to select the class you want a certain class to promote to. For instance, say you want Micaiah to go from a Light Sage to a Chancellor. You would put Light Sage in the Top Left section and Chancellor in this section. In Part-4 E-1 when Micaiah promotes to her final class, she will become a Chancellor instead.\n\nBottom Left:\nThis section is used to edit the base/max stats of a class. This section is self explanatory. I believe there are minimums stored but I have not looked for that.\n\nBottom Right:\nThis section allows you to edit the class' min and max ranks for each category. Note that setting the minimum higher will not change a characters current rank. The minimum ranks are only applied on promote. Changing the max rank will allow the class to reach those new limits. You can give class' the ability to use a category they cannot natively use, but it requires also setting a minimum rank. Use this with a character rank code to get the cap maxed.",
        "Item": 
            "In this window there are 4 main sections. The only required section is the Top item selection but if you make no other changes then it will not be able to create a code. Please note that editing an item will affect any character/enemy that has that item. Also note that the cap for these sections is 255.\n\nTop: This section is used to select the item that you want to edit.\n\nLeft:\nThis section is used to edit the attributes of the item selected. This should be pretty self explanatory. The Char Unlock feature may not work as intended. Report any bugs on my discord.\n\nMiddle:\nThis section is used to edit the stats of the item.\n\n Right:\nThis section is used to edit the stat bonuses when an item/weapon is equipped. Think like Ragnell that gives +5 defense or Rudol Gem that gives +10 defense.",
        "Database": 
            "This window is a database of codes that I like and use that cannot be make via the Code Wizard. All you need to do is click the button on the one you want and a code will be generated for you with your current Controller and Version selection. There will be a description for each ones as well. Some codes require alteration, which will also be stated in the description. These codes should all work for NTSC, but I have not converted all to PAL. If there is a code you want added, please send a message in my discord server."
    }
}